## 네트워크
---
### 네트워크 구성요소
**네트워크 평가기준과 링크의 연결형태**
#### 1. 네트워크: 노드가 통신 링크로 연결된 집합체
#### 2. 종단장치(사용자 장치, 궁극적으로 사용자가 사용하는 마지막 장치)
- PC, 노트북, 스마트폰 등
#### 3. 내부장치
- 서버, 라우터, 스위치 등
#### 4. 네트워크의 성능은 `처리량`과 `지연시간`으로 구분한다.
 - 처리량: 링크를 통해 전달되는 단위 시간당 데이터의 양
 > _처리량이 많은(많은 양의 트래픽을 통과 시킬 수 있는) 네트워크가 좋은 네트워크_
 - 지연시간
   - 경유시간: 한 장치에서 다른 장치로 데이터가 `전달`되는데 걸리는 시간
   - 응답시간: 요청과 이에 대한 `응답`에 소요된 시간
   - 왕복시간: 출발지에서 목적지까지 갔다가 돌아오는데 걸리는 시간(RTT, Round Trip Time)

#### 5. 링크의 연결 형태
- point-to-point 
- multipoint

---
### 네트워크 구조
**네트워크 토폴로지와 분류**
#### 1. 토폴로지(Toplogy)
 - 네트워크의 구성요소인 장치와 링크가 어떻게 배치되어 있는가
#### 2. 네트워크 토폴로지의 형태
- Mesh: 여러 개의 장치들이 서로 상관성 없이 연결되어있는 구조
- Star: **Hub**라는 네트워크 연결장치로 케이블을 통해 **컴퓨터를 일대일로 연결**(허브를 중심으로 컴퓨터 배치모양이 별과 같아서 Star)
- Bus: 케이블 하나를 **여러 개의 시스템**들이 연결되어 있는 형태
- Ring: 링형태로 구성
![](https://images.velog.io/images/anjaekk/post/1cc405fe-e778-4d17-9b6b-8a651e08b5f1/image.png)
> _실제 네트워크 토폴로지는 링이면 링, 스타면 스타 이렇게 단일적으로 존재하는 것이 아닌 **다양한 토폴로지가 서로 유기적으로 연결되어 있음**_
#### 3. 네트워크의 분류
- LAN(Local-area network): 장개인적으로 연결(**소유주가 개인**)
- MAN(Mtropolitan-area network): 도시 정도의 크기를 포함하는 규모
- WAN(Wide-area network): 전국, 전세계 규모의 광범위한 네트워크
 > _전세계에서 사용가능한 `인터넷`은 `WAN`에 속한다_

\* 내용 출처: 쉽게 배우는 네트워크 강의(한국직업방송)
\* 그림 출처: 위키피디아
